; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 258422 2 3 4 6 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image2 - mode
	image3 - mode
	image1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star2 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 image3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 image2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Planet6 image3)
	(have_image Star7 image1)
	(have_image Planet8 image3)
	(have_image Star9 image2)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 image3)
))

)

; plan
1. (turn_to satellite0 star9 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
2. (turn_to satellite1 star9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star9)
   goals met: 0 of 7
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
4. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
5. (turn_to satellite1 star7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star7)
   goals met: 0 of 7
6. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 7
7. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 7
8. (turn_to satellite1 groundstation5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 7
9. (turn_to satellite0 phenomenon10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 7
10. (calibrate satellite1 instrument3 groundstation5)
   added: (calibrated instrument3)
   goals met: 0 of 7
11. (take_image satellite0 phenomenon10 instrument0 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 1 of 7
12. (turn_to satellite1 star9 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star9)
   goals met: 1 of 7
13. (turn_to satellite0 star7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star7)
   goals met: 2 of 7
14. (take_image satellite1 star9 instrument3 image2)
   added: (have_image star9 image2)
   goals met: 3 of 7
15. (turn_to satellite1 star7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star7)
   goals met: 3 of 7
16. (turn_to satellite0 star11 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star11)
   goals met: 2 of 7
17. (take_image satellite1 star7 instrument3 image1)
   added: (have_image star7 image1)
   goals met: 3 of 7
18. (take_image satellite0 star11 instrument0 image3)
   added: (have_image star11 image3)
   goals met: 4 of 7
19. (turn_to satellite0 star7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star7)
   goals met: 5 of 7
20. (turn_to satellite0 planet8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet8)
   goals met: 4 of 7
21. (take_image satellite0 planet8 instrument0 image3)
   added: (have_image planet8 image3)
   goals met: 5 of 7
22. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 6 of 7
23. (turn_to satellite0 planet6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet6)
   goals met: 5 of 7
24. (take_image satellite0 planet6 instrument0 image3)
   added: (have_image planet6 image3)
   goals met: 6 of 7
25. (turn_to satellite0 star7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star7)
   goals met: 7 of 7
